CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_BasicPin(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTA1 (number 51), UART0_SWO_RX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_UART0_SWO_UART0_SWO_RX_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_UART0_SWO_UART0_SWO_RX_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_UART0_SWO_UART0_SWO_RX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTA2 (number 52), UART0_SWO_TX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_UART0_SWO_UART0_SWO_TX_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_UART0_SWO_UART0_SWO_TX_PIN 2U                   /*!<@brief PORT pin number */
#define RTEPIN_UART0_SWO_UART0_SWO_TX_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_Uart0_SWO(void);

/*! @name PORTD8 (number 137), IMU_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_IMU_SCL_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_IMU_SCL_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_IMU_SCL_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD9 (number 138), IMU_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_IMU_SDA_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_IMU_SDA_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_IMU_SDA_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTE11 (number 14), SERVO_1
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_SERVO_1_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_SERVO_1_PIN 11U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_SERVO_1_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE12 (number 15), SERVO_2
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_SERVO_2_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_SERVO_2_PIN 12U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_SERVO_2_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE6 (number 9), BUTTON_DN
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_BUTTON_DN_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_BUTTON_DN_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_BUTTON_DN_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_BUTTON_DN_PIN 6U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_BUTTON_DN_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTE7 (number 10), BUTTON_RT
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_BUTTON_RT_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_BUTTON_RT_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_BUTTON_RT_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_BUTTON_RT_PIN 7U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_BUTTON_RT_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTE8 (number 11), BUTTON_OK
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_BUTTON_OK_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_BUTTON_OK_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_BUTTON_OK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_BUTTON_OK_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_BUTTON_OK_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTE9 (number 12), BUTTON_UP
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_BUTTON_UP_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_BUTTON_UP_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_BUTTON_UP_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_BUTTON_UP_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_BUTTON_UP_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTE10 (number 13), BUTTON_LF
  @{ */

