CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_BUTTON_LF_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_BUTTON_LF_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_BUTTON_LF_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_BUTTON_LF_PIN 10U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_BUTTON_LF_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name ADC0_SE16 (number 36), MAG_0
  @{ */
/* @} */

/*! @name ADC0_SE23 (number 38), MAG_1
  @{ */
/* @} */

/*! @name PORTE24 (number 45), MAG_2
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_MAG_2_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_MAG_2_PIN 24U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_MAG_2_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE25 (number 46), MAG_3
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_MAG_3_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_MAG_3_PIN 25U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_MAG_3_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTA7 (number 59), MAG_4
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_MAG_4_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_MAG_4_PIN 7U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_MAG_4_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTA8 (number 60), MAG_5
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_MAG_5_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_MAG_5_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_MAG_5_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTA12 (number 64), SWITCH_1
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_SWITCH_1_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_SWITCH_1_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_SWITCH_1_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_SWITCH_1_PIN 12U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_SWITCH_1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTA14 (number 66), SWITCH_2
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_SWITCH_2_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_SWITCH_2_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_SWITCH_2_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_SWITCH_2_PIN 14U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_SWITCH_2_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTA16 (number 68), SWITCH_3
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_SWITCH_3_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_SWITCH_3_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_SWITCH_3_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_SWITCH_3_PIN 16U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_SWITCH_3_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTA19 (number 73), SWITCH_4
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_SWITCH_4_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_SWITCH_4_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_SWITCH_4_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_SWITCH_4_PIN 19U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_SWITCH_4_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTB0 (number 81), ENC_LA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_ENC_LA_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_ENC_LA_PIN 0U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_ENC_LA_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB1 (number 82), ENC_LB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_ENC_LB_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_ENC_LB_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_ENC_LB_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB18 (number 97), ENC_RA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_ENC_RA_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_ENC_RA_PIN 18U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_ENC_RA_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                      /* @} */

