CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/*! @name PORTB19 (number 98), ENC_RB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_ENC_RB_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_ENC_RB_PIN 19U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_ENC_RB_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC1 (number 104), MOTOR_LA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_MOTOR_LA_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_MOTOR_LA_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_MOTOR_LA_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC2 (number 105), MOTOR_LB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_MOTOR_LB_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_MOTOR_LB_PIN 2U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_MOTOR_LB_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC3 (number 106), MOTOR_RA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_MOTOR_RA_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_MOTOR_RA_PIN 3U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_MOTOR_RA_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC4 (number 109), MOTOR_RB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_MOTOR_RB_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_MOTOR_RB_PIN 4U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_MOTOR_RB_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC6 (number 111), CAM_VSNC
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_CAM_VSNC_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_CAM_VSNC_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_CAM_VSNC_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_CAM_VSNC_PIN 6U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_CAM_VSNC_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC8 (number 113), CAM_D0
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_CAM_D0_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_CAM_D0_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_CAM_D0_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_CAM_D0_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_CAM_D0_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTC9 (number 114), CAM_D1
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_CAM_D1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_CAM_D1_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_CAM_D1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_CAM_D1_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_CAM_D1_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTC10 (number 115), CAM_D2
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_CAM_D2_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_CAM_D2_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_CAM_D2_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_CAM_D2_PIN 10U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_CAM_D2_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC11 (number 116), CAM_D3
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_CAM_D3_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_CAM_D3_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_CAM_D3_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_CAM_D3_PIN 11U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_CAM_D3_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC12 (number 117), CAM_D4
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_CAM_D4_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_CAM_D4_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_CAM_D4_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_CAM_D4_PIN 12U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_CAM_D4_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC13 (number 118), CAM_D5
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_CAM_D5_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_CAM_D5_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_CAM_D5_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_CAM_D5_PIN 13U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_CAM_D5_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC14 (number 119), CAM_D6
  @{ */

