CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_CAM_D6_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_CAM_D6_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_CAM_D6_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_CAM_D6_PIN 14U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_CAM_D6_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC15 (number 120), CAM_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_CAM_D7_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_CAM_D7_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_CAM_D7_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_CAM_D7_PIN 15U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_CAM_D7_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC16 (number 123), CAM_RX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_CAM_RX_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_CAM_RX_PIN 16U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_CAM_RX_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC17 (number 124), CAM_TX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_CAM_TX_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_CAM_TX_PIN 17U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_CAM_TX_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC18 (number 125), CAM_PCLK
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_CAM_PCLK_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_CAM_PCLK_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_CAM_PCLK_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_CAM_PCLK_PIN 18U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_CAM_PCLK_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTD14 (number 143), OLED_2
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_OLED_D_C_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_OLED_D_C_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_OLED_D_C_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_OLED_D_C_PIN 14U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_OLED_D_C_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTD15 (number 144), OLED_4
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BOARD_OLED_RST_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BOARD_OLED_RST_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BOARD_OLED_RST_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BOARD_OLED_RST_PIN 15U                   /*!<@brief PORT pin number */
#define RTEPIN_BOARD_OLED_RST_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_Board(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTD6 (number 133), UART0_SPP_RX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_UART0_EXT_UART0_SPP_RX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_UART0_EXT_UART0_SPP_RX_PIN 6U                   /*!<@brief PORT pin number */
#define RTEPIN_UART0_EXT_UART0_SPP_RX_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTD7 (number 136), UART0_SPP_TX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_UART0_EXT_UART0_SPP_TX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_UART0_EXT_UART0_SPP_TX_PIN 7U                   /*!<@brief PORT pin number */
#define RTEPIN_UART0_EXT_UART0_SPP_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_Uart0_EXT(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
